# TBB_OpenTBBSelDlg

## Description
Open Title Block Border Selection Dialog

```pascal
PROCEDURE TBB_OpenTBBSelDlg(
				VAR StyleName : STRING;
				VAR SheetSize : STRING;
				VAR TBWidth   : REAL;
				VAR TBHeight  : REAL);
```

```python
def vs.TBB_OpenTBBSelDlg(StyleName, SheetSize, TBWidth, TBHeight):
    return (StyleName, SheetSize, TBWidth, TBHeight)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|StyleName|STRING|   |
|SheetSize|STRING|   |
|TBWidth|REAL|   |
|TBHeight|REAL|   |

## Version
Availability: from Vectorworks 2019

## Category
* Utility